facebook-creator-platform/test/load/write-posts.yml
config:
  # Default: local Docker stack. Override for staging/prod:
  #   artillery run --target https://staging.example.com test/load/write-posts.yml
  target: "http://localhost:3000"
  processor: "../helpers/processor.cjs"
  phases:
    - duration: 30
      arrivalRate: 2
      rampTo: 30
      name: "ramp"
    - duration: 60
      arrivalRate: 30
      name: "burst"
    - duration: 30
      arrivalRate: 5
      name: "cooldown"
  plugins:
    # expect plugin must be declared — without it `expect:` blocks are silently ignored.
    expect:
      outputFormat: prettyError
      reportFailuresAsErrors: true
    metrics-by-endpoint:
      useOnlyRequestNames: true
  ensure:
    p99: 500
    maxErrorRate: 1
  defaults:
    headers:
      authorization: "Bearer {{ $processEnvironment.TEST_JWT }}"
      content-type: "application/json"

# Write-path scenario (NFR: burst ~30 wps, p99 < 500 ms).
# Exercises the full create-post path: guard check → quota check → persist → event.
# Each VU creates a post, reads it back, then transitions it to `scheduled` — covering
# the heavier event-emitting PATCH /status write path (Post publish transitions ~5,000/day).
#
# Run:
#   pnpm load:write
# or:
#   API_URL=http://localhost:3000 TEST_JWT=<token> WORKSPACE_ID=<uuid> \
#     artillery run test/load/write-posts.yml -o test/load/reports/write.json
#
# Required env:
#   API_URL      — e.g. http://localhost:3000
#   TEST_JWT     — a valid Clerk JWT with Owner or Editor role on the test workspace
#   WORKSPACE_ID — UUID of a seeded test workspace

scenarios:
  - name: "create and read posts"
    flow:
      - post:
          name: "POST /workspaces/:id/posts"
          url: "/api/v1/workspaces/{{ $processEnvironment.WORKSPACE_ID }}/posts"
          json:
            content: "Load test post {{ $uuid }}"
          capture:
            - json: "$.id"
              as: "postId"
          expect:
            - statusCode: 201

      - get:
          name: "GET /workspaces/:id/posts/:postId"
          url: "/api/v1/workspaces/{{ $processEnvironment.WORKSPACE_ID }}/posts/{{ postId }}"
          ifTrue: "postId"
          expect:
            - statusCode: 200

      - function: "setFutureScheduledAt"

      - patch:
          name: "PATCH /posts/:id/status (→ scheduled)"
          url: "/api/v1/workspaces/{{ $processEnvironment.WORKSPACE_ID }}/posts/{{ postId }}/status"
          ifTrue: "postId"
          json:
            status: "scheduled"
            scheduledAt: "{{ scheduledAt }}"
          expect:
            - statusCode: 200